from xml.dom import minidom #导入模块
from fontTools.ttLib import TTFont

code_list = []

def getcode():
    dom = minidom.parse('12644549.xml')
    g = dom.getElementsByTagName('GlyphID')
    print(len(g))
    for i in range(2, len(g)):  # 获取节点属性
        code_list.append(g[i].getAttribute("name")[3:7])

def changexml():
    font=TTFont('./woff/12644549.woff')#读取woff文件
    font.saveXML('./12644549.xml')#转成xml

def combine():
    chinese = '1234567890店中美家馆小车大市公酒行国品发电金心业商司超' \
       '生装园场食有新限天面工服海华水房饰城乐汽香部利子老艺花专东肉菜' \
       '学福饭人百餐茶务通味所山区门药银农龙停尚安广鑫一容动南具源兴' \
       '鲜记时机烤文康信果阳理锅宝达地儿衣特产西批坊州牛佳化五米修' \
       '爱北养卖建材三会鸡室红站德王光名丽油院堂烧江社合星货型村自科快' \
       '便日民营和活童明器烟育宾精屋经居庄石'\
       '顺林尔县手厅销用好客火雅盛体旅之鞋辣作粉包楼校鱼平彩上' \
       '吧保永万物教吃设医正造丰健点汤网庆技斯洗料配汇木缘加麻联卫川泰色世方' \
       '寓风幼羊烫来高厂兰阿贝皮全女拉成云维贸道术运都口博河瑞宏京际路祥青' \
       '镇厨培力惠连马鸿钢训影甲助窗布富牌头四多妆吉苑沙恒隆春干饼氏里二管' \
       '诚制售嘉长轩杂副清计黄讯太鸭号街交与叉附近层旁对巷栋环省桥湖段乡厦' \
       '府铺内侧元购前幢滨处向座下啥凤港开关景泉塘放昌线湾政步宁解白田町溪' \
       '十八古双胜本单同九迎第台玉锦底后七斜期武岭松角纪朝峰六振珠局岗洲横边' \
       '济井办汉代临弄团外塔杨铁浦字年岛陵原梅进荣友虹央桂沿事津凯莲丁秀柳集' \
       '紫旗张谷的是不了很还个也这我就在以可到错没去过感次要比觉看得说常真们' \
       '但最喜哈么别位能较境非为欢然他挺看价那意种想出员两推做排实分间甜' \
       '度起满给热完格荐喝等其再几只现朋候样直而买于般豆量选奶打每评少算' \
       '又因情找些份置适什蛋师气你姐棒试总定啊足级整带虾如态且尝主话强当' \
       '更板知己无酸让入啦式笑赞片酱差像提队走嫩才刚午接重串回晚微周值费' \
       '性桌拍跟块调糕'
    temp = ''
    for i in range(0, len(chinese)):
        temp += '\'\\\\'+ code_list[i] + '\': \'' + chinese[i] + '\''+',  '
        if len(chinese) - i > 6:
            if i%7 == 6:
                print(temp)
                temp = ''
        else:
            print(temp)

if __name__ == '__main__':
    changexml()
    getcode()
    combine()